# Metaphor Refantazio

written on 3 dec, 2024, havent finished game.

Clear game on 11 dec, 2024

總評價:核心玩法比p系列好，然而故事雖然比p5r有深意但表達方式和手法太差，感覺比人龍8差好遠。

## 主題
遊戲真正既主題其實相當有意義, anxiety 其實係現代社會既最大問題, 現代互聯網將二元思維同遠離現實既人生帶到社會-> anxiety-> 社會對立, 不婚無後, 然後進入一個惡性循環, 假如遊戲係真係圍繞既個theme 去講就相當好。然而,實際上遊戲前中期一直講種族平等, 然後又一堆小學生政見演講, 個主題要過完第3 個伏筆之後先出現, 而且同玩家現實完全無映射同比較地方, 結果就係兩頭唔到岸, 成個故事就係一個故事, 雖有好既立意但係玩家無法體會。

遊戲亦只係最後一句先提出對anxiety既解決方法就係相信幻想有改變世界既力量,認真講確實相信有一個美好未來先有可能令世界更好，但係全個遊戲表現既個主題既地方係完全見唔到,除左最後比你看一年後既後日談以外, 前邊就算follower故事都唔多表達到既樣野,一係就無描寫過痛苦(e.g. catherina, hulkenburg, brigitta, junah, gallica), 一係就無描寫由絕望到相信既過程 (e.g. basillio, heismay, strohl)。然而後日談亦因為玩家沒有過多接觸太多世界既絕望(最多就所謂歧視, 說實話比現實既歧視更輕，然後咩人體實驗就完全無再提過),令到個相信效果表達唔到出來。

而且遊戲一開始問玩家名同主角名,好明顯係想利用既樣野令玩家唔輕易代入，但係結果係全程都唔代入,只有ending先真係同玩家溝通。最後More打破第四面牆個段明明只要將個表現手法由主角見到shibuya->話現實先係主角理想世界->問主角即使故事世界絕望都要繼續? 改成牆開變shibuya->由第三身視角變第一身，dialog變成玩家名->問即使世界絕望都要繼續? 更能表達個遊戲主題,亦都係全遊戲最能夠說服玩家既地方(比其他個d伏筆震撼好多)。感覺故事好似大改過, 變到唔似p系列可以令玩家代入主角享受同反思人際關係, 又無法帶出佢想表達既信息, 我唯一感覺就係好多位明明可以表現得更好明明可以改成表達到個主題, 結果四不像。follower既故事又好,主線故事都好,我既感覺就只係觀眾, 對於角色既行為0 共感0共情, 好多明顯既催淚位(e.g.聖女, dal)都只令我覺得莫名奇妙。

## 故事
當初見人話故事王道然後有伏筆先買, 個遊戲demo 又好一開始宜傳都好, 我既看法一直都係persona結構係無法講現實主題, p5r嘗試過做既野, 係一個fantasy world 再現只會更差, p5r仍然可以用主角群未成年去解釋(當然並不合理, 而且只係表現出佢地無自省能力), metaphor就係一種我完全唔知需唔需要解釋既情況, 就因為設定上係現代後700 年,邏輯上即係同現實0 關係既情況, 佢地同現實觀點同思考完全唔一樣係合理, 但係比玩家看係唔合理。由demo開始, 我完全無法理解任何人既行動同觀點, 一直講種族, 但係實際咩種族我要load一陣先知講咩, d種族名同特徵0關係(咩elda, pupirus) 要玩到接近完game 先知原來有8個種族(我check過memorandum係無提過)故事對話係有真實感,畢竟日常生活係社會已知種族既前題下提種族唔正常, 但對玩家而言係不知所謂既level,428接近20年前既遊戲都會有用字說明(而且428設定係現實),既隻game係0說明, memorandum講既野係玩家見過既內容,細節無大補充,而且每樣野都相當短,完全無法理解背景。

故事由太子既視角組成,所以一直將太子作為下一個繼承人既觀點講,但係玩家只會覺得莫名奇妙,對國王,王子,國家都0認識,無啦啦要完全接受既種觀點相當奇怪。而且所有planning都極簡陋,玩demo以為個阿伯視死如歸(無既個抽寫,純粹自我解釋)先話其他人引開d guard,自己一個人一把劍衝入去殺louis(前邊仲要一直講louis幾強),成件事就算無咩國王保護都唔會成功,最痴既係要一直要同maria解釋佢失敗,大佬你既個計劃點樣唔失敗。demo後就每段故事都係一堆既個類型既痴線planning,louis,forden,聖女d plan都係簡單到幾個step就完,中間無內容,無思考exception點做,然後既幾個抽寫都係比較多心機同視野。主角方就長期係strohl出計, 佢d plan 超簡單而且無一次成功,一開始話要拿返支槍所以要出去認刺殺認王子派,然後認完槍又拿唔返而且直接將主角群身份爆出來, 完全負作用計劃。

話故事王道, 我覺得應該係用童話來形容比較合理。假如將故事核心簡化就係一個國王選舉主角用愛去感化人既童話故事, 但係一放大就係一個無policy既政客一直講理想觀點, 其他侯選人就係一堆小朋友policy(童話其實好常見),主角就係一方面用現實話既堆policy差, 另一方面提出唔到任何野既政客。同時玩家除左種族問題以外對國家問題係0認識, 做成一種異常脫離現實既討論(就算日日講種族既歐美都唔會只有一個social issue講)。而主角既反面louis又係另一個得一個policy既政客(將anxiety射返比人民去進化社會)玩家就好似係一班痴既人中正常人感覺。
伏筆就更加係一堆gimmick,好多伏筆都係為伏而伏而且超明顯, demo時就好容易估到殺王子既唔係louis,主角係王子既d伏筆, 然而既堆伏筆除左強行拉長個故事以外毫無意義。殺王子唔係louis但係最後都係要打louis,王子係同唔係主角都0意義,主角係王子死之後立場上必須繼續扮王子，畢竟當初話自己係王子就係為王子參選鋪路。咩現代後700年又係d為加而加既伏筆,咩magla同個種族演化完全唔可能用科學解釋,基本上成個同現代與人既故事關係既伏筆對故事其實無任何幫助除左wow你一下之外。

故事上經常出現一堆超奇怪既情緒,要同聖女打,d主角群問主角o唔ok,其實主角唔多識佢,無私人交往過,有咩o唔ok呢?又唔見有人care佢個妹?然後最後打完zombra又莫名奇妙同情佢,做咩呢?louis將佢點有咩好同情or共情呢?除左打過兩次同見過兩次面外又係0交往0認識。最好笑係既d情緒,正常game可以解釋為玩家看唔到既時侯有交往,但係p系列遊戲你每日都玩每日都跟住主角視角無既種解釋。

一堆細刺同唔合理既細位就唔寫, 第一次寫得太長。

## 故事設定
完全無意義或者只提一次既故事設定太多, 多到我可以寫條list,好多刪左都唔會影響故事
以下無順序list:
* 現實700 年後 (感覺本身係為左帶主題, 但係全程只講左一次就完)
* igniter 係用來控制anxiety變成魔力, 應該係為左解釋主角團能用魔力唔係特別人, 但係其實唔多合理, 畢竟個royal scepter長期收anxiety, igniter又有咩剩比佢控制呢? 
* royal scepter收anxiety, 這個完全係為左講資本社會下既分工logic, 然而同本身遊戲體驗無任何符合既地方, 相當多既boss係anxiety係主要動機, 而且當魔法回頭既時候個表現出來群眾anxiety又無幾誇張
* 種族其實都係人, 既個就有少少似係一種想玩家反思既設定, 但係現實歧視係更多係歷史上既恩恕同媒體文化既炒作做成, 遊戲既無映射既點亦無實際解釋現實既野, 就只係想表達8 個種族完全唔同都係人, 現實個種族difference仲細但卻四分五裂既思想。只可以話既個topic本身就係一個極複雜既問題, 種族問題唔係實際問題而係由定義就看得出既人性問題，遊戲唔提呢個設定仲好
* More係國王, 個作用係想表達國王想賭佢既繼承人王子可以得到國民信任, 帶領民眾改變世界, 但係More 係與唔係國王對既野樣0 影響，大不了話More記返起自己係國王魔法一部份就一樣, 而且成件事搞到好似分靈好容易好簡單, 王子又分靈, 國王又分靈

好多設定感覺想帶出主題, 但係唔多合理做成個效果好差
* 主角本幻想書係玩家現實, ending 亦都播出書既完整內容。有人話係為左話你看我好,我看你好既情況。 但係呢種情況無咩特別,係無detail既情況當然會覺得人地描寫既野好完美, 畢竟utopia 係因為無講清楚同深入先可能存在。只可以話呢個設定令我感覺主角群都無咩思考能力, 佢地覺得玩家現實理想只係單純地因為相信一堆無例子既完美, 然後投射係故事世界中。
* 古廟中間既新宿。本身應該係連700年後設定一齊wow玩家，但係個場景A: 同新宿完全無關,B:明明係入口下邊第2層,個古廟係個島到, 即係應該係水平面下邊, 點解會係下邊個窗見到天? C: 中間同上下風格格格不入,上下都係陰暗同似金子塔中間就半科技風,logic上係新宿上邊建廟就唔會有最底既古廟, 無咩理由會建一個廟穿過遺址,再係遺址(地底)再向下再建古廟。 

## 角色描寫
由於成個遊戲體驗都無咩共感(好既描寫應該得hulkenburg)所以只寫我覺得有問題既角色描寫。
* Louis: 好多人覺得前期寫得好,被刺後差。我覺得個角色其實就始終如一地旁若無人, 無論係前期既搶王位定後期既上天空都係口講話想世界用實力judge人, 其實佢本人唔多care個世界點, 只係想貫徹自己(佢自認自己實力強, 所以先會話用實力至上社會)。既個描寫無咩問題, 但係佢每次明明都打輸主角團(愈後邊玩家愈容易打敗佢), 偏偏遊戲又強行放走佢/無啦啦反敗為勝, 而且發生左3次, 成件事就令我覺得個故事強行將一個唔夠強既反派推成最終boss
* Alonzo: 想描寫一個騙子失去最親後痛改前非用佢能力假死幫助主角, 但係成件事係玩家角度係莫名奇妙。明明玩家已經全國第二,佢無啦啦要假死去令主角受歡迎, 而且又唔係一條大村, 純粹令我覺得佢做完只係為左自我滿足。

## 遊戲機制
其實比p系列改進左一d,主要變化係多左1.重開制, 2.合體技, 3.隨意轉主角外既職, 逐個講問題:
1. 重開其實幾好,玩家可以試下唔同既策略同試weakness, 但係佢唔比係敵人turn重開就好煩,有時想賭critical 拿半turn賭唔中或者random miss左, 成日都要等對手完turn先重開得, 純粹浪費時間
2. 最有意義既改進,玩家可以做既選擇多左好多而且令到遊戲一d op技可以放入去平衡
3. 同2有種相輔相成既效果,逼玩家要思考想要op職定op技, 後期多左royal職之後其實幾相鎖定玩家要升某一d職業,同以前persona比其實好d

完game後覺得個機制無問題, 但係數字好崩壞, 最後一個月既trial可以感受到第一個all repel龍我係用錢打完,但係打起來超慢,每一次用錢扣200-400, 最後一個trial我用同一個方法結果次次都比佢9999秒全場(網上話咩著repel其實無影響, 應該係本身有turn limit,仍只要rotation 2 prince就會放), 然後跟攻略用升攻擊降敵防->上弱點->上魔/物雙倍就8000->魔/物最強技兩次就秒左boss(即係20-40 倍)。最後一日堆boss大部份都好似笑話, louis比我兩個turn 秒左, 個感覺就係所有其他技同archetype(特別係martial artist, samarai, ninja個系)都無咩意思。
